#主程序：
#baseAddr 0000
add   $4,  $0,  $0;            #$4 = 0000_0000   源数据区域首址                        00002020
addi  $5,  $0,  20;            #$5 = 0000_0014   目的数据区域首址                      20050014
addi  $6,  $0,  10;            #$6 = 0000_000A   复制的数据个数                        2006000a
jal   BankMove;                #$31 = (PC+4)，PC跳转到BankMove入口                     0c000004

#BankMove 子程序：
add   $8,  $4,  $0;            #$8  = 0000_0000  源数据区域首址                        00804020
add   $9,  $5,  $0;            #$9  = 0000_0014  目的数据区域首址                      00a04820
add   $10, $6,  $0;            #$10 = 0000_000A  数据块长度                            00c05020

#Loop1 循环
Loop1:
lw    $11, 0($8);              #$11 = mem(0000_0000) = 8888_8888         取出源数据    8d0b0000
sw    $11, 0($9);              #mem(0000_0014) = $11 = 8888_8888        存入目的区     ad2b0000
addi  $10, $10, -1;            #$10 = $10 - 1  (0000_0009 → … → 0000_0000)          214AFFFF
bne   $10, $0,  Loop1;         #若$10 ≠ 0，PC跳回Loop1                                1540fffc
jr    $31;                     #PC = $31，子程序返回                                  03e00008
